In [1]:
from importlib import reload
import sql2py as sp
reload(sp)

In [2]:
df = sp.create_test_df()
df.sample(3)

    id_       date_ bin1 bin2 mul1 mul2      num1      num2
66   66  2000-07-10    A    T    Z    S  0.792956  0.289287
29   29  2000-11-27    B    F    Z    M  0.327195  0.065735
68   68  2000-05-22    B    F    Y    S  0.045113  0.912739

In [5]:
df.describe()

              id_        num1       num2
count  100.000000  100.000000  99.000000
mean    49.500000    0.507115   0.521059
std     29.011492    0.302895   0.288854
min      0.000000    0.032586   0.005566
25%     24.750000    0.236760   0.254017
50%     49.500000    0.512142   0.536649
75%     74.250000    0.776328   0.748093
max     99.000000    0.998079   0.962034

In [3]:
sp.count_star_grpby(df, 'bin1')

  bin1  count
0    A     62
1    B     38

In [4]:
sp.count_star_grpby(df, ['bin1', 'bin2'])

  bin1 bin2  count
0    A    F     33
1    A    T     29
2    B    F     16
3    B    T     21